W6D5/my_99_cats/app/views/cat_rental_requests/new.html.erb

        <select name="cat_rental_request[cat_id]" id="cat_rental_request_cat_id">
        <% Cat.all.each do |cat| %>
---
SELECT "cats".* FROM "cats"