W8D1/reddit_clone/app/controllers/application_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."session_token" = $1 LIMIT $2  [["session_token", "aQSaAOWSUytC4RYnTrvCXQ"], ["LIMIT", 1]]
---
    def current_user
        @current_user ||= User.find_by(session: session[:session_token])