W6D5/my_99_cats/app/controllers/cats_controller.rb

SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def show
        @cat = Cat.find_by(id: params[:id]) # @Cat = Cat.find(params[:id])